; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain thoughtful-typed)
	(:requirements :typing)
	(:types card colnum num suittype)
	(:predicates (on ?c1 - card ?c2 - card)
		(ace ?c - card)
		(king ?c - card)
		(clear ?c - card)
		(colspace ?n - colnum)
  		(bottomtalon ?c - card)
		(toptalon ?c - card)
		(ontalon ?c1 - card ?c2 - card)
		(talonplayable ?c - card)
		(instack ?c - card)
		(home ?c - card)
		(faceup ?c - card)
		(bottomcol ?c - card)
		(suit ?c - card ?s - suittype)
		(value ?c - card ?v - num)
		(successor ?n1 - num ?n0 - num)
		(canstack ?c1 - card ?c2 - card)
		(colsuccessor ?n1 - colnum ?n0 - colnum)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card between columns.  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from one column to another

	(:action move-col-to-col
		:parameters (?dummy - card ?card ?oldcard ?newcard - card)
		:precondition (and 
			(faceup ?card)
			(clear ?newcard)
			(canstack ?card ?newcard)
			(on ?card ?oldcard))
		:effect(and
			(on ?card ?newcard)
			(clear ?oldcard)
			(faceup ?oldcard)
			(not (on ?card ?oldcard))
			(not (clear ?newcard))))

;; move card from one column to another - create an empty column

	(:action move-col-to-col-b
		:parameters (?dummy - card ?card ?newcard - card ?cols ?ncols - colnum)
		:precondition (and 
				(faceup ?card)
				(bottomcol ?card)
				(clear ?newcard)
				(canstack ?card ?newcard)
				(colspace ?cols)
				(colsuccessor ?ncols ?cols))
		:effect (and 
			(on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; send a king to an empty column

	(:action move-col-to-col-c
		:parameters (?dummy - card ?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(faceup ?card)
			(king ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
		:effect (and
			(bottomcol ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(colspace ?ncols)
			(not (on ?card ?oldcard))
			(not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from column to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action col-to-home
		:parameters (?dummy - card ?card ?oldcard - card ?suit - suittype ?vcard - num
				?homecard - card ?vhomecard - num)
		:precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(on ?card ?homecard)
			(not (on ?card ?oldcard))
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))))

;; Move card from column to home - create an empty column

	(:action col-to-home-b
		:parameters (?dummy - card ?card ?homecard - card ?suit - suittype ?vcard - num
			?vhomecard - num ?cols ?ncols - colnum)
		:precondition (and
			(clear ?card)
			(bottomcol ?card)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(colspace ?cols)
			(colsuccessor ?ncols ?cols))
		:effect (and
			(home ?card)
			(colspace ?ncols)
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))
			(not (bottomcol ?card))
			(not (colspace ?cols))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to column 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action tal-to-col
		:parameters (?dummy - card ?card ?oldcard ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(on ?card ?newcard)
			(ontalon ?cardabove ?oldcard)
			(not (clear ?newcard))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is bottom card in talon

	(:action tal-to-col-b
		:parameters (?dummy - card ?card ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (clear ?newcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is top card in talon

	(:action tal-to-col-c
		:parameters (?dummy - card ?card ?newcard ?oldcard - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(canstack ?card ?newcard)
			(talonplayable ?card)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move card from talon to column - card is the only card in talon

	(:action tal-to-col-d
		:parameters (?dummy - card ?card ?newcard - card)
		:precondition (and
			(clear ?newcard)
			(canstack ?card ?newcard)
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;; move king from talon to column

	(:action tal-to-col-e
		:parameters (?dummy - card ?card ?oldcard ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(ontalon ?cardabove ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - king is bottom card in talon

	(:action tal-to-col-f
		:parameters (?dummy - card ?card ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - card is top card in talon

	(:action tal-to-col-g
		:parameters (?dummy - card ?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move king from talon to column - card is the only card in talon

	(:action tal-to-col-h
		:parameters (?dummy - card ?card - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(bottomtalon ?card)
			(toptalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from talon to home

	(:action tal-to-home
		:parameters (?dummy - card ?card ?cardabove ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(ontalon ?card ?cardbelow)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(home ?homecard)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(talonplayable ?cardbelow)
			(not (talonplayable ?card))
			(ontalon ?cardabove ?cardbelow)
			(not (ontalon ?cardabove ?card))
			(not (ontalon ?card ?cardbelow))
			(home ?card)
			(not (home ?homecard))))

;; move card from talon to home - card is bottom card in talon

	(:action tal-to-home-b
		:parameters (?dummy - card ?card ?cardabove ?homecard  - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(bottomtalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(home ?card)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))
			(not (home ?homecard))))

;; move card from talon to home - card is top card in talon

	(:action tal-to-home-c
		:parameters (?dummy - card ?card ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(ontalon ?card ?cardbelow)
			(talonplayable ?card)
			(toptalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(toptalon ?cardbelow)
			(talonplayable ?cardbelow)
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?cardbelow))))

;; move card from talon to home - card is the only card in talon

	(:action tal-to-home-d
		:parameters (?dummy - card ?card ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from home to column (pointless to move aces from home)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from home to column
	
	(:action home-to-col
		:parameters (?dummy - card ?card ?cardbelow ?newcard - card ?cardsuit - suittype
			?vcard ?vcardbelow - num)
		:precondition (and
			(home ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(canstack ?card ?newcard)
			(clear ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(home ?cardbelow)
			(on ?card ?newcard)
			(not (home ?card))
			(not (clear ?newcard))))

;; move king from home to column
	
	(:action home-to-col-a
		:parameters (?dummy - card ?card ?cardbelow - card ?cardsuit - suittype
			?vcard ?vcardbelow - num ?cols ?ncols - colnum)
		:precondition (and
			(home ?card)
			(king ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(home ?cardbelow)
			(bottomcol ?card)
			(clear ?card)
			(faceup ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (home ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Turn Deck
;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			
;; turn deck

	(:action turn-deck
		:parameters (?dummy - card ?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?c1 ?card))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card))))

;; turn deck - top talon card is currently talon playable	- at least 4 cards in talon

	(:action turn-deck-a
		:parameters (?dummy - card ?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(toptalon ?card)
			(bottomtalon ?c1))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card)))))
			
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; problem
(define (problem thoughtful-s5-t4)
(:domain thoughtful-typed)
(:objects
    DUMMY1 DUMMY2 DUMMY3 DUMMY4
    C0 CA C2 C3 C4 C5 
    D0 DA D2 D3 D4 D5 
    H0 HA H2 H3 H4 H5 
    S0 SA S2 S3 S4 S5 
 - card
    COLN0 COLN1 COLN2 COLN3 COLN4
 - colnum
    N0 N1 N2 N3 N4 N5
 - num
    C D H S
 - suittype
)
(:init
(VALUE C0 N0)
(VALUE D0 N0)
(VALUE H0 N0)
(VALUE S0 N0)
(VALUE CA N1)
(VALUE DA N1)
(VALUE HA N1)
(VALUE SA N1)
(VALUE C2 N2)
(VALUE D2 N2)
(VALUE H2 N2)
(VALUE S2 N2)
(VALUE C3 N3)
(VALUE D3 N3)
(VALUE H3 N3)
(VALUE S3 N3)
(VALUE C4 N4)
(VALUE D4 N4)
(VALUE H4 N4)
(VALUE S4 N4)
(VALUE C5 N5)
(VALUE D5 N5)
(VALUE H5 N5)
(VALUE S5 N5)
(COLSUCCESSOR COLN1 COLN0)
(COLSUCCESSOR COLN2 COLN1)
(COLSUCCESSOR COLN3 COLN2)
(COLSUCCESSOR COLN4 COLN3)
(SUCCESSOR N1 N0)
(SUCCESSOR N2 N1)
(SUCCESSOR N3 N2)
(SUCCESSOR N4 N3)
(SUCCESSOR N5 N4)
(SUIT C0 C)
(SUIT D0 D)
(SUIT H0 H)
(SUIT S0 S)
(SUIT CA C)
(SUIT DA D)
(SUIT HA H)
(SUIT SA S)
(SUIT C2 C)
(SUIT D2 D)
(SUIT H2 H)
(SUIT S2 S)
(SUIT C3 C)
(SUIT D3 D)
(SUIT H3 H)
(SUIT S3 S)
(SUIT C4 C)
(SUIT D4 D)
(SUIT H4 H)
(SUIT S4 S)
(SUIT C5 C)
(SUIT D5 D)
(SUIT H5 H)
(SUIT S5 S)
(KING C5)
(KING D5)
(KING H5)
(KING S5)
(CANSTACK C2 D3)
(CANSTACK C2 H3)
(CANSTACK S2 D3)
(CANSTACK S2 H3)
(CANSTACK D2 C3)
(CANSTACK D2 S3)
(CANSTACK H2 C3)
(CANSTACK H2 S3)
(CANSTACK C3 D4)
(CANSTACK C3 H4)
(CANSTACK S3 D4)
(CANSTACK S3 H4)
(CANSTACK D3 C4)
(CANSTACK D3 S4)
(CANSTACK H3 C4)
(CANSTACK H3 S4)
(CANSTACK C4 D5)
(CANSTACK C4 H5)
(CANSTACK S4 D5)
(CANSTACK S4 H5)
(CANSTACK D4 C5)
(CANSTACK D4 S5)
(CANSTACK H4 C5)
(CANSTACK H4 S5)
(COLSPACE COLN0)
(BOTTOMCOL HA)
(CLEAR HA)
(FACEUP HA)
(BOTTOMCOL H5)
(ON C4 H5)
(CLEAR C4)
(FACEUP C4)
(BOTTOMCOL D2)
(ON H3 D2)
(ON S5 H3)
(CLEAR S5)
(FACEUP S5)
(BOTTOMCOL D4)
(ON C3 D4)
(ON SA C3)
(ON CA SA)
(CLEAR CA)
(FACEUP CA)
(BOTTOMTALON S3)
(ONTALON D3 S3)
(ONTALON D5 D3)
(ONTALON H4 D5)
(ONTALON C2 H4)
(ONTALON S4 C2)
(ONTALON DA S4)
(ONTALON C5 DA)
(ONTALON S2 C5)
(ONTALON H2 S2)
(TOPTALON H2)
(TALONPLAYABLE D5)
(HOME C0)
(HOME D0)
(HOME H0)
(HOME S0)
)
(:goal
(and
(HOME C5)
(HOME D5)
(HOME H5)
(HOME S5)
)
)
)

; plan
1. (col-to-home-b s3 ha h0 h n1 n0 coln0 coln1)
   deleted: (home h0) (faceup ha) (clear ha) (bottomcol ha) (colspace coln0)
   added: (home ha) (colspace coln1)
   goals met: 0 of 4
2. (col-to-home c0 ca sa c n1 c0 n0)
   deleted: (on ca sa) (home c0) (faceup ca) (clear ca)
   added: (home ca) (clear sa) (faceup sa) (on ca c0)
   goals met: 0 of 4
3. (move-col-to-col-c c0 s5 h3 coln1 coln0)
   deleted: (on s5 h3) (colspace coln1)
   added: (bottomcol s5) (clear h3) (faceup h3) (colspace coln0)
   goals met: 0 of 4
4. (turn-deck c0 d5 h4)
   deleted: (talonplayable d5)
   added: (talonplayable h4)
   goals met: 0 of 4
5. (turn-deck c0 h4 c2)
   deleted: (talonplayable h4)
   added: (talonplayable c2)
   goals met: 0 of 4
6. (col-to-home c0 sa c3 s n1 s0 n0)
   deleted: (on sa c3) (home s0) (faceup sa) (clear sa)
   added: (home sa) (clear c3) (faceup c3) (on sa s0)
   goals met: 0 of 4
7. (tal-to-home c0 c2 s4 h4 ca c n2 n1)
   deleted: (talonplayable c2) (ontalon s4 c2) (ontalon c2 h4) (home ca)
   added: (talonplayable h4) (ontalon s4 h4) (home c2)
   goals met: 0 of 4
8. (turn-deck c0 h4 s4)
   deleted: (talonplayable h4)
   added: (talonplayable s4)
   goals met: 0 of 4
9. (turn-deck c0 s4 da)
   deleted: (talonplayable s4)
   added: (talonplayable da)
   goals met: 0 of 4
10. (tal-to-home c0 da c5 s4 d0 d n1 n0)
   deleted: (talonplayable da) (ontalon c5 da) (ontalon da s4) (home d0)
   added: (talonplayable s4) (ontalon c5 s4) (home da)
   goals met: 0 of 4
11. (col-to-home c0 c3 d4 c n3 c2 n2)
   deleted: (on c3 d4) (home c2) (faceup c3) (clear c3)
   added: (home c3) (clear d4) (faceup d4) (on c3 c2)
   goals met: 0 of 4
12. (turn-deck c0 s4 c5)
   deleted: (talonplayable s4)
   added: (talonplayable c5)
   goals met: 0 of 4
13. (col-to-home c0 c4 h5 c n4 c3 n3)
   deleted: (on c4 h5) (home c3) (faceup c4) (clear c4)
   added: (home c4) (clear h5) (faceup h5) (on c4 c3)
   goals met: 0 of 4
14. (tal-to-home c0 c5 s2 s4 c4 c n5 n4)
   deleted: (talonplayable c5) (ontalon s2 c5) (ontalon c5 s4) (home c4)
   added: (talonplayable s4) (ontalon s2 s4) (home c5)
   goals met: 1 of 4
15. (turn-deck c0 s4 s2)
   deleted: (talonplayable s4)
   added: (talonplayable s2)
   goals met: 1 of 4
16. (tal-to-home c0 s2 h2 s4 sa s n2 n1)
   deleted: (talonplayable s2) (ontalon h2 s2) (ontalon s2 s4) (home sa)
   added: (talonplayable s4) (ontalon h2 s4) (home s2)
   goals met: 1 of 4
17. (turn-deck c0 s4 h2)
   deleted: (talonplayable s4)
   added: (talonplayable h2)
   goals met: 1 of 4
18. (tal-to-home-c c0 h2 s4 ha h n2 n1)
   deleted: (home ha) (toptalon h2) (talonplayable h2) (ontalon h2 s4)
   added: (toptalon s4) (talonplayable s4) (home h2)
   goals met: 1 of 4
19. (col-to-home c0 h3 d2 h n3 h2 n2)
   deleted: (on h3 d2) (home h2) (faceup h3) (clear h3)
   added: (home h3) (clear d2) (faceup d2) (on h3 h2)
   goals met: 1 of 4
20. (col-to-home-b c0 d2 da d n2 n1 coln0 coln1)
   deleted: (home da) (faceup d2) (clear d2) (bottomcol d2) (colspace coln0)
   added: (home d2) (colspace coln1)
   goals met: 1 of 4
21. (turn-deck-a c0 s4 s3)
   deleted: (talonplayable s4)
   added: (talonplayable s3)
   goals met: 1 of 4
22. (tal-to-home-b c0 s3 d3 s2 s n3 n2)
   deleted: (bottomtalon s3) (talonplayable s3) (ontalon d3 s3) (home s2)
   added: (bottomtalon d3) (talonplayable d3) (home s3)
   goals met: 1 of 4
23. (tal-to-home-b c0 d3 d5 d2 d n3 n2)
   deleted: (bottomtalon d3) (talonplayable d3) (ontalon d5 d3) (home d2)
   added: (bottomtalon d5) (talonplayable d5) (home d3)
   goals met: 1 of 4
24. (col-to-home-b c0 d4 d3 d n4 n3 coln1 coln2)
   deleted: (home d3) (faceup d4) (clear d4) (bottomcol d4) (colspace coln1)
   added: (home d4) (colspace coln2)
   goals met: 1 of 4
25. (tal-to-home-b c0 d5 h4 d4 d n5 n4)
   deleted: (bottomtalon d5) (talonplayable d5) (ontalon h4 d5) (home d4)
   added: (bottomtalon h4) (talonplayable h4) (home d5)
   goals met: 2 of 4
26. (tal-to-home-b c0 h4 s4 h3 h n4 n3)
   deleted: (bottomtalon h4) (talonplayable h4) (ontalon s4 h4) (home h3)
   added: (bottomtalon s4) (talonplayable s4) (home h4)
   goals met: 2 of 4
27. (tal-to-home-d c0 s4 s3 s n4 n3)
   deleted: (home s3) (toptalon s4) (talonplayable s4) (bottomtalon s4)
   added: (home s4)
   goals met: 2 of 4
28. (col-to-home-b c0 s5 s4 s n5 n4 coln2 coln3)
   deleted: (home s4) (faceup s5) (clear s5) (bottomcol s5) (colspace coln2)
   added: (home s5) (colspace coln3)
   goals met: 3 of 4
29. (col-to-home-b c0 h5 h4 h n5 n4 coln3 coln4)
   deleted: (home h4) (faceup h5) (clear h5) (bottomcol h5) (colspace coln3)
   added: (home h5) (colspace coln4)
   goals met: 4 of 4
